12/data/attachments/1eb9e61b4f4df16b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cade49a0-d31e-482a-b58c-40693a53e945</nif:username>
            <nif:friendToBeAdded>Rose_just_Friend_43010_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>